do

function run(msg, matches)
  return [[ 
قبل لتشوف الاوامر تابع قناة السورس @S94IQ ❤️💋

✔️تعمل جميع الاوامر بدون وضع / او !
ا🔸➖🔹➖🔸➖🔹➖🔸

❣ م1 : لعرض الاوامر الريئسيه

❣ م2  :لعرض الاوامر الثانويه
          [ويمكن للعضو استخدامها]

❣م المطور : لعرض اوامر المطور

❣الاصدار : لعرض موقع السورس✋🏿

❣dev  : لعرض من صنع البوت اوالسورس

ا🔸➖🔹➖🔸➖🔹➖🔸
👇🏿تأبعـونأَ كل جَديد عل قنأةَ السورس👇🏿
                 [ @S94IQ ]
👇🏿للأستفسار:- راسل المطور:- ☢⚜ 
❣ #Dev : @SAJJADNOORI
❣ #Dev_bot : @S94_BOT

]]


end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(الاوامر)$",
},
run = run 
}
end
