do

function run(msg, matches)
  return [[ 
✔️ DEV MOHAMMED HISHAM
🔸➖🔹➖🔸➖🔹➖🔸

🔶  م1 : لعرض الاوامر الرئيسية

🔶  م2  :لعرض الاوامر الثانويه
          [ويمكن للعضو استخدامها]

🔶 م المطور : لعرض اوامر المطور 🏿

🔶 dev  : لعرض من صنع البوت اوالسورس

ا🔸➖🔹➖🔸➖🔹➖🔸
👇🏿تأبعـونأَ كل جَديد عل قنأةَ السورس👇🏿
                 [ @llDEV1ll ]
👇🏿للأستفسار:- راسل المطور:- ☢⚜ 🔶 DEV:- @TH3BOSS
🔶 SUPPORT :- @ll60Kllbot
]]


end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(الاوامر)$",
},
run = run 
}
end
