--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY MOHAMMED HISHAM              ▀▄ ▄▀ 
▀▄ ▄▀ BY MOHAMMEDHISHAM (@TH3BOSS)          ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY MOHAMMED HISHAM        ▀▄ ▄▀   
▀▄ ▄▀          HELP2  : 2مساعدة              ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function mohammed(msg, matches)
local reply_id = msg['id']
local S = [[ 
📍💭 اوامر تخص المجموعه 🀄️

🎈 ضع صوره : ↭↜ ( لوضع وصف للمجموعه) 
🎈 ضع قوانين : ↭↜ ( لوضع قوانين للمجموعه )
🎈 ضع معرف : ↭↜ ( لوضع معرف للمجموعه)
🎈 ضع وصف : ↭↜ ( لوضع وصف للمجموعه )
🎈 ضع اسم : ↭↜ ( لوضع اسم جديد للمجموعه )
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
💥 ضع معرف : ↭↜ ( لوضع معرف للمجموعه )
💥 ضع رابط : ↭↜ ( لوضع رابط للمجموعه )
💥 الرابط : ↭↜ ( لعرض رابط المجموعه )
💥 الرابط خاص : ↭↜ ( لارسال الرابط الى الخاص)
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
📍💭 اوامر رؤية الاعدادات 🀄️

📋   القوانين : ↭↜ ( لعرض  القوانين )
📋   الوصف : ↭↜ ( لعرض  الوصف )
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
♨️   الادمنيه : ↭↜ ( لعرض  الادمنيه )
♨️  الاداريين : ↭↜ ( لعرض  الاداريين )
♨️   المكتومين : ↭↜ ( لعرض  المكتومين )
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
💢  المطور : ↭↜ ( لعرض معلومات المطور )
💢  معلوماتي : ↭↜ ( لعرض معلومات العضو )
💢  الاعدادت : ↭↜ ( لعرض اعدادات المجموعه ) 
💢  اعدادات الوسائط : ↭↜ ( لعرض اعدادات الميديا )
💢  معلومات المجموعه : ↭↜ ( لعرض معلومات المجموعه )
🔸➖🔹➖🔸➖🔹➖
💯-Đєⱴ💀: @TH3BOSS
💯-Đєⱴ ฿๏ͳ💀: @ll60Kllbot
💯-Đєⱴ Ϲḫ₳ͷͷєℓ💀: @llDEV1ll
]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م2)$",
},
run = mohammed 
}
end
