--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY MOHAMMED HISHAM              ▀▄ ▄▀ 
▀▄ ▄▀ BY MOHAMMEDHISHAM (@TH3BOSS)          ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY MOHAMMED HISHAM        ▀▄ ▄▀   
▀▄ ▄▀          مساعدة 3                    ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

function run(msg, matches)
local reply_id = msg['id']
local S = [[ 
📍💭 اوامر حماية المجموعة 🀄️

💎 "قفل / فتح" الاضافه :↭↜ (التحكم بالاضافه داخل المجموعه)
💎 "قفل / فتح" الدردرشه :↭↜ (التحكم بالدردشه داخل المجموعه)
💎 "قفل / فتح" الملصقات :↭↜ (التحكم بالملصقات داخل المجموعه)
💎 "قفل / فتح" الروابط :↭↜ (التحكم بلروابط داخل المجموعه)
💎 "قفل / فتح" البوتات :↭↜ (التحكم بلبوتات داخل المجموعه)
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ

🛡 "قفل / فتح" اعاده توجيه :↭↜ (التحكم باعادة التوجيه في المجموعه)
🛡 "قفل / فتح" الكلايش :↭↜ (التحكم بالكلايش داخل المجموعه)
🛡 "قفل / فتح" التكرار :↭↜ (التحكم في التكرار المجموعه)
🛡 "قفل / فتح" العربيه :↭↜ ( التحكم باللغه داخل المجموعه)
🛡 "قفل / فتح" جهات الاتصال :↭↜ (التحكم بالجهات في المجموعه)
🔸➖🔹➖🔸➖🔹➖
♣️Dev💀: @TH3BOSS
 ♣️Dev bot💀: @ll60Kllbot 
♣️DevChannel 💀: @llDEV1ll ]]
reply_msg(reply_id, S, ok_cb, false)
end

return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م3)$",
},
run = run 
}
end
