--[[ 
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                       ▀▄ ▄▀ 
▀▄ ▄▀       BY MOHAMMED HISHAM              ▀▄ ▄▀ 
▀▄ ▄▀ BY MOHAMMEDHISHAM (@TH3BOSS)          ▀▄ ▄▀          
▀▄ ▄▀ JUST WRITED BY MOHAMMED HISHAM        ▀▄ ▄▀   
▀▄ ▄▀            مساعدة 1                 ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]
do

local function mohammed(msg, matches)
local reply_id = msg['id']
if is_momod(msg) and matches[1]== 'م1' then
local S = [[  📍💭 اوامر حماية المجموعه 🀄️

💎 رفع ادمن :↭↜ ( لرفع ادمن في المجموعه )
💎 تنزيل ادمن : ↭↜ ( لتنزيل ادمن في المجموعه )
💎 الادمنيه : ↭↜ ( لعرض قائمة الادمنيه)
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
📍💭 اوامر تخص الادمنيه 🀄️

♨ حظر : ↭↜( لحظر وطرد عضو من المجموعه )
♨ الغاء الحظر : ↭↜ ( لالغاء الحظر عن عضو )
♨ منع : ↭↜ ( لمنع كلمه داخل المجموعه )
♨ الغاء منع : ↭↜ ( لالغاء منع كلمه داخل المجموعه )
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
♨ قفل الوسائط : ↭↜( لقفل جميع الوسائط  )
♨ فتح الوسائط : ↭↜( لفتح جميع الوسائط  )
ـ🔸➖🔹➖🔸➖🔹➖🔸ـ
♨ كتم بالرد : ↭↜ ( لكتم عضو بواسطة الرد )
♨ ايدي : ↭↜ ( لعرض ايدي المجموعه )
♨ ايدي بالرد : ↭↜ ( لعرض ايدي العضو )
 🔸➖🔹➖🔸➖🔹➖
💯-Đєⱴ💀: @TH3BOSS
💯-Đєⱴ ฿๏ͳ💀: @ll60Kllbot
💯-Đєⱴ Ϲḫ₳ͷͷєℓ💀: @llDEV1ll
]]
reply_msg(reply_id, S, ok_cb, false) 
end

if not is_momod(msg) then
local S = "ليش اصير دوده😎🖕🏿"
reply_msg(reply_id, S, ok_cb, false)
end

end
return {
description = "Help list", 
usage = "Help list",
patterns = {
"^(م1)$",
},
run = mohammed 
}
end
